# Написать функцию `is_prime`, принимающую 1 аргумент — число от 0 до 1000, и возвращающую `True`, если оно простое,
# и `False` - иначе.
# (Простые числа - те которые делятся без остатка только на само себя или 1, например 2, 3, 5, 7, 11...)

#x = int(input('Введите число от 0 до 1000: '))
#
#def is_prime(y):
#    for z in range(2, y+1):
#        if y % z == 0: #or z % 1 == 0:
#            print('False')
#        else:
#            print('True')
#    return y
#
#print(is_prime(x))
