#Написать программу "Показать звезды". На вход принимает обычное целое число, должно напечатать количество звезд.

x = int(input('Input number of stars: '))

print('*' * x)
