#Напишите программу, которая приветствует пользователя, выводя слово `Hello`, введенное имя и знаки препинания

name=input('What is your name: ')

print('Hello, {0}!'.format(name))
